'''Дано текстові файли f1 і f2. Переписати зі збереженням порядку проходження
кожен другий компонент файлу f1 в f2, а кожен другий компонент файлу f2 - в файл f1.
Використовувати допоміжний файл h.
Виконав: Лещенко В. О.'''

with open('f1.txt', 'r') as f1:
    f1_read = f1.read()
    with open('h.txt', 'w') as h:
        for i in range(0, len(f1_read) - 1, 2):
            h.write(f1_read[i]) # записуємо кожний другий компонент f1 в допоміжний файл h
with open('f2.txt', 'r') as f2:
    f2_read = f2.read()
    with open('f1.txt', 'w') as f1:
        for i in range(0, len(f2_read) - 1, 2):
            f1.write(f2_read[i]) # записуємо в f1 кожний другий компонент f2
with open('h.txt', 'r') as h:
    h_read = h.read()
with open('f2.txt', 'w') as f2:
    f2.write(h_read) # записуємо компоненти із h в f2, таким чином ми перезаписали кожен другий компонент
                     # файлу f1 в f2, а кожен другий компонент файлу f2 - в файл f1.